<script setup>

</script>

<template>
  <span>
    Директивы Vue.js это специальные атрибуты, которые мы можем использовать внутри html шаблона компонента vue, для
        того чтобы тем или иным образом взаимодействовать с html тегами и не только. Все директивы обычно начинаются с
        буквы v, затем через дефис идет название директивы. Сейчас мы разберем основные директивы, которые вы будете
        наиболее часто использовать в вашем Vue приложении.
  </span>
  
</template>

<style scoped>
span {
    color: azure;
    font-size: 30px;
    font-weight: 600;
    text-align: center;
    align-items: center;
    min-height: 100vh;
}
</style>